In [76]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns 
from datetime import datetime

In [77]:
data = pd.read_csv("chicago.csv")
data.head()

,Unnamed: 0,Start Time,End Time,Trip Duration,Start Station,End Station,User Type,Gender,Birth Year
0,1423854,2017-06-23 15:09:32,2017-06-23 15:14:53,321,Wood St & Hubbard St,Damen Ave & Chicago Ave,Subscriber,Male,1992.0
1,955915,2017-05-25 18:19:03,2017-05-25 18:45:53,1610,Theater on the Lake,Sheffield Ave & Waveland Ave,Subscriber,Female,1992.0
2,9031,2017-01-04 08:27:49,2017-01-04 08:34:45,416,May St & Taylor St,Wood St & Taylor St,Subscriber,Male,1981.0
3,304487,2017-03-06 13:49:38,2017-03-06 13:55:28,350,Christiana Ave & Lawrence Ave,St. Louis Ave & Balmoral Ave,Subscriber,Male,1986.0
4,45207,2017-01-17 14:53:07,2017-01-17 15:02:01,534,Clark St & Randolph St,Desplaines St & Jackson Blvd,Subscriber,Male,1975.0

In [78]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 9 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Unnamed: 0     300000 non-null  int64
 1   Start Time     300000 non-null  object
 2   End Time       300000 non-null  object
 3   Trip Duration  300000 non-null  int64
 4   Start Station  300000 non-null  object
 5   End Station    300000 non-null  object
 6   User Type      300000 non-null  object
 7   Gender         238948 non-null  object
 8   Birth Year     238981 non-null  float64
dtypes: float64(1), int64(2), object(6)
memory usage: 20.6+ MB

*Changing the Column Names to get rid of the spaces*

In [79]:
namechange = {'Start Time' : 'starttime' ,
               'End Time' : 'endtime' ,
               'Trip Duration' : 'tripduration' ,
               'Start Station' : 'startstation' ,
               'End Station' : 'endstation' ,
               'User Type' : 'usertype' ,
               'Birth Year' : 'birthyear'}
data.rename(columns = namechange , inplace = True)

In [80]:
data.drop('Unnamed: 0' ,axis=1 , inplace = True)

In [81]:
data.head()

,starttime,endtime,tripduration,startstation,endstation,usertype,Gender,birthyear
0,2017-06-23 15:09:32,2017-06-23 15:14:53,321,Wood St & Hubbard St,Damen Ave & Chicago Ave,Subscriber,Male,1992.0
1,2017-05-25 18:19:03,2017-05-25 18:45:53,1610,Theater on the Lake,Sheffield Ave & Waveland Ave,Subscriber,Female,1992.0
2,2017-01-04 08:27:49,2017-01-04 08:34:45,416,May St & Taylor St,Wood St & Taylor St,Subscriber,Male,1981.0
3,2017-03-06 13:49:38,2017-03-06 13:55:28,350,Christiana Ave & Lawrence Ave,St. Louis Ave & Balmoral Ave,Subscriber,Male,1986.0
4,2017-01-17 14:53:07,2017-01-17 15:02:01,534,Clark St & Randolph St,Desplaines St & Jackson Blvd,Subscriber,Male,1975.0

*Checking for duplicates and dropping them*

In [82]:
data.duplicated().sum()

20

In [83]:
data.drop_duplicates(inplace = True)

In [84]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 299980 entries, 0 to 299999
Data columns (total 8 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   starttime     299980 non-null  object
 1   endtime       299980 non-null  object
 2   tripduration  299980 non-null  int64
 3   startstation  299980 non-null  object
 4   endstation    299980 non-null  object
 5   usertype      299980 non-null  object
 6   Gender        238940 non-null  object
 7   birthyear     238973 non-null  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 20.6+ MB

In [85]:
# converting starttime and endtime columns to date time format
data['starttime'] = pd.to_datetime(data['starttime'])
data['endtime'] = pd.to_datetime(data['endtime'])

# extracting month and dow from start time\n",
data['month'] = data['starttime'].dt.month_name(locale = 'English')
data['day_of_week'] = data['starttime'].dt.day_name(locale = 'English')

# to seperate the date and time in the starttime and endtime columns
data['Startdate'] = data['starttime'].dt.date
data['Starttime'] = data['starttime'].dt.time
data['Enddate'] = data['endtime'].dt.date
data['Endtime'] = data['endtime'].dt.time

#converting the extracted Starttime and Endtime column to the 12-hour format
data['Starttime'] =  pd.to_datetime(data['Starttime'], format = '%H:%M:%S').dt.strftime('%I:%M:%S %p')
data['Endtime'] =  pd.to_datetime(data['Endtime'], format = '%H:%M:%S').dt.strftime('%I:%M:%S %p')

In [86]:
# to calculate the riders age as at 2017 and create a new column
data['age'] = 2017 - data['birthyear']

In [87]:
data.isnull().sum()

starttime           0
endtime             0
tripduration        0
startstation        0
endstation          0
usertype            0
Gender          61040
birthyear       61007
month               0
day_of_week         0
Startdate           0
Starttime           0
Enddate             0
Endtime             0
age             61007
dtype: int64

*Filling the null values in the gender column with unspecified and the null values in the age columns with 0*

In [88]:
data['Gender'].fillna('Unspecified', inplace = True)
data['age'].fillna( 0, inplace = True)

In [89]:
data.isnull().sum()

starttime           0
endtime             0
tripduration        0
startstation        0
endstation          0
usertype            0
Gender              0
birthyear       61007
month               0
day_of_week         0
Startdate           0
Starttime           0
Enddate             0
Endtime             0
age                 0
dtype: int64

In [90]:
data.head()

,starttime,endtime,tripduration,startstation,endstation,usertype,Gender,birthyear,month,day_of_week,Startdate,Starttime,Enddate,Endtime,age
0,2017-06-23 15:09:32,2017-06-23 15:14:53,321,Wood St & Hubbard St,Damen Ave & Chicago Ave,Subscriber,Male,1992.0,June,Friday,2017-06-23,03:09:32 PM,2017-06-23,03:14:53 PM,25.0
1,2017-05-25 18:19:03,2017-05-25 18:45:53,1610,Theater on the Lake,Sheffield Ave & Waveland Ave,Subscriber,Female,1992.0,May,Thursday,2017-05-25,06:19:03 PM,2017-05-25,06:45:53 PM,25.0
2,2017-01-04 08:27:49,2017-01-04 08:34:45,416,May St & Taylor St,Wood St & Taylor St,Subscriber,Male,1981.0,January,Wednesday,2017-01-04,08:27:49 AM,2017-01-04,08:34:45 AM,36.0
3,2017-03-06 13:49:38,2017-03-06 13:55:28,350,Christiana Ave & Lawrence Ave,St. Louis Ave & Balmoral Ave,Subscriber,Male,1986.0,March,Monday,2017-03-06,01:49:38 PM,2017-03-06,01:55:28 PM,31.0
4,2017-01-17 14:53:07,2017-01-17 15:02:01,534,Clark St & Randolph St,Desplaines St & Jackson Blvd,Subscriber,Male,1975.0,January,Tuesday,2017-01-17,02:53:07 PM,2017-01-17,03:02:01 PM,42.0

In [91]:
#Saving the cleaned table 
data.to_csv('chicagocleaned.csv',index = False)